---
## Front matter
lang: ru-RU
title: Лабораторная работа №11
subtitle: Администрирование сетевых подсистем
author:
  - Ищенко Ирина НПИбд-02-22
institute:
  - Российский университет дружбы народов, Москва, Россия


## i18n babel
babel-lang: russian
babel-otherlangs: english

## Formatting pdf
toc: false
toc-title: Содержание
slide_level: 2
aspectratio: 169
section-titles: true
theme: metropolis
header-includes:
 - \metroset{progressbar=frametitle,sectionpage=progressbar,numbering=fraction}
---

## Цель работы

Приобретение практических навыков по настройке удалённого доступа к серверу с помощью SSH.

# Выполнение лабораторной работы

##

![Попытка установить SSH-соединение](image/1.png){#fig:001 width=70%}

##

![Запрет входа на сервер пользователю root](image/2.png){#fig:002 width=70%}

##

![Повторная попытка SSH-соединение](image/3.png){#fig:003 width=70%}

##

![Попытка установить SSH-соединение с клиента](image/4.png){#fig:004 width=70%}

##

![Мониторинг](image/5.png){#fig:005 width=70%}

##

![Изменение разрешенных пользователей для sshd](image/6.png){#fig:006 width=70%}

##

![Определение службы аутентификации пользователей](image/7.png){#fig:007 width=70%}

##

![Изменение разрешенных пользователей для sshd](image/8.png){#fig:008 width=70%}

##

![Временный запуск SMTP-сервера](image/9.png){#fig:009 width=70%}

##

![Добавление портов в файл конфигураций](image/10.png){#fig:0010 width=70%}

##

![Расширенный статус работы sshd](image/11.png){#fig:011 width=70%}

##

![Мониторинг системных сообщений](image/12.png){#fig:012 width=70%}

##

![Просмотр расширенного статуса работы sshd после настройки работы по порту 2022](image/13.png){#fig:013 width=70%}

##

![Установка SSH-соединение с клиента](image/14.png){#fig:014 width=70%}

##

![Установка SSH-соединение с клиента с указанием порта 2022](image/15.png){#fig:015 width=70%}

##

![Установка SSH-соединение с клиента](image/16.png){#fig:016 width=70%}

##

![Создание и копирование открытого ключа, установка SSH-соединения с сервером с клиента](image/17.png){#fig:017 width=70%}

##

![Просмотр активных служб с протоколом TCP](image/18.png){#fig:018 width=70%}

##

![Просмотр локального сервера в браузере на клиенте](image/19.png){#fig:019 width=70%}

##

![Просмотр информации о сервере c клиента через ssh](image/20.png){#fig:020 width=70%}

##

![Просмотр почты сервера c клиента через ssh](image/21.png){#fig:021 width=70%}

##

![Просмотр информации о сервере c клиента через ssh](image/22.png){#fig:022 width=70%}

##

![Запуск графического приложения через ssh](image/23.png){#fig:023 width=70%}

## Выводы

В ходе выполнения данной работы я приобрела практические навыки по настройке удалённого доступа к серверу с помощью SSH.
